app/views/shared/_game.html.haml

SELECT "frames".* FROM "frames" WHERE ("frames".game_id = 1)
---
  %tr
    -@game.frames.each do |frame|