app/views/games/show.html.haml

    -(1..10).each do |frameid|
      -@frame = Frame.find(frameid)
---
SELECT "frames".* FROM "frames" WHERE "frames"."id" = 1 LIMIT 1