app/controllers/frames_controller.rb

  def index
    @frames = Frame.all
---
SELECT "frames".* FROM "frames"

  def show
    @frame = Frame.find(params[:id])
---
SELECT "frames".* FROM "frames" WHERE "frames"."id" = 1 LIMIT 1

  def edit
    @frame = Frame.find(params[:id])
---
SELECT "frames".* FROM "frames" WHERE "frames"."id" = 1 LIMIT 1

  def create
    @frame = Frame.new(params[:frame])

    respond_to do |format|
      if @frame.save
---
INSERT INTO "frames" ("ball1", "ball2", "created_at", "updated_at", "total") VALUES (5, 5, '2011-09-17 21:42:53.701183', '2011-09-17 21:42:53.701183', NULL)

  def update
    @frame = Frame.find(params[:id])
    rewrite_totals
    respond_to do |format|
      if @frame.update_attributes(params[:frame])
---
SELECT "frames".* FROM "frames" WHERE "frames"."id" = 1 LIMIT 1
UPDATE "frames" SET "ball1" = NULL, "ball2" = 10, "updated_at" = '2011-09-20 03:22:34.301781' WHERE "frames"."id" = 1

  def clear_all
    @frames = Frame.all
    @frames.each do |frame|
      frame.ball1 = nil
      frame.ball2 = nil
      frame.total = nil
      render('pages/home', :error => 'Sorry, there was a problem.') unless frame.save!
---
SELECT "frames".* FROM "frames"
UPDATE "frames" SET "ball1" = NULL, "ball2" = NULL, "total" = NULL, "updated_at" = '2011-09-20 04:59:00.648042' WHERE "frames"."id" = 10