app/controllers/games_controller.rb

  def show
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1

  def edit
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1

  def create
    @game = Game.new

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("current_frame", "created_at", "updated_at") VALUES (6, '2011-09-23 17:24:45.759299', '2011-09-23 17:24:45.759299')

  def update
    @game = Game.find(params[:id])
    @game.current_frame = params[:current_frame]
    @game.save!
---
SELECT "games".* FROM "games" WHERE "games"."id" = 2 LIMIT 1
UPDATE "games" SET "current_frame" = 1, "updated_at" = '2011-09-27 16:31:30.018461' WHERE "games"."id" = 2