app/controllers/pages_controller.rb

SELECT "frames".* FROM "frames" WHERE ("frames".game_id = 1)
SELECT "tasks".* FROM "tasks"
---
  def home
    @frames = Frame.all
    @tasks = Task.all