app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
---
  def show
    @task = Task.find(params[:id])

SELECT "games".* FROM "games" LIMIT 1
INSERT INTO "tasks" ("name", "created_at", "updated_at") VALUES ('make a task scaffold', '2011-09-13 18:45:39.440655', '2011-09-13 18:45:39.440655')
---
  def create
    @task = Task.new(params[:task])
    @game = Game.first

    respond_to do |format|
      if @game.tasks.create(@task)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 13 LIMIT 1
UPDATE "tasks" SET "name" = 'Bring back the ''total'' fields', "updated_at" = '2011-09-28 19:32:34.814142' WHERE "tasks"."id" = 13
---
  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])